# DBeam_GetLast2DObj

## Description
Return the most recently created 2D beam object

```pascal
FUNCTION DBeam_GetLast2DObj : HANDLE;
```

```python
def vs.DBeam_GetLast2DObj():
    return HANDLE
```

## Version
Availability: from Vectorworks 2011

## Category
* Spotlight